Autodesk.Revit.DB.MultiReferenceAnnotationOptions.ElementsMatchReferenceCategory(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Verifies that all of the elements match the reference category required
by the MultiReferenceAnnotationType.
elements:
The elements to test.
Returns:
True if all the elements match the reference category required by the MultiReferenceAnnotationType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.SetElementsToDimension(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the elements which the dimension will witness.
Remarks:
The dimension will automatically find geometric references in the elements.
elementsToDimension:
The elements which the dimension will witness.
Throws Autodesk.Revit.Exceptions.ArgumentException:
some elements do not match the reference category required by the MultiReferenceAnnotationType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The MultiReferenceAnnotationType assigned to the options can't create MultiReferenceAnnotations by element.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.ReferencesDontMatchReferenceCategory(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Verifies that all of the references belongs to elements which doesn't match the
reference category required by the MultiReferenceAnnotationType.
references:
The references to test.
Returns:
Returns true if the element categories of all tested references do not match the element category required by the MultiReferenceAnnotationType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.SetAdditionalReferencesToDimension(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Sets the additional references which the dimension will witness.
Remarks:
The additional references to dimension cannot come from the same category as the MultiReferenceAnnotationType's reference category.
referencesToDimension:
The additional references which the dimension will witness.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Some references come from elements which directly match the reference category required by the MultiReferenceAnnotationType. For
those elements please use SetElementsToDimension.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.GetAdditionalReferencesToDimension
Gets the additional references which the dimension will witness.
Remarks:
These references may be to elements of other categories than the reference category returned by MultiReferenceAnnotationType.
Returns:
The additional references which the dimension will witness.
Since:
2020

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.TagHeadPosition
The position for the tag's head.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.DimensionLineOrigin
The origin point for the dimension line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.DimensionLineDirection
The direction vector of the dimension line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: dimensionLineDirection is not length 1.0.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.DimensionPlaneNormal
The normal vector to the dimension plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: dimensionPlaneNormal is not length 1.0.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.#ctor(Autodesk.Revit.DB.MultiReferenceAnnotationType)
Create an instance of Multi-Reference Annotation Options set with default values.
multiReferenceAnnotationType:
The MultiReferenceAnnotationType to be used by the new MultiReferenceAnnotation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014